remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam/boards/sam4s_wpir_rd/sam4s_wpir_rd.h
/**
 * \file
 *
 * \brief SAM4S-WPIR-RD Board Definition.
 *
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4S_WPIR_RD_H_
#define _SAM4S_WPIR_RD_H_

#include <conf_board.h>

#define BOARD_REV_A

/*----------------------------------------------------------------------------*/

/**
 *  \page sam4s_wpir-rd_opfreq "SAM4S-WPIR-RD - Operating frequencies"
 *  This page lists several definition related to the board operating frequency
 *
 *  \section Definitions
 *  - \ref BOARD_FREQ_*
 *  - \ref BOARD_MCK
 */

/** Board oscillator settings */
#define BOARD_FREQ_SLCK_XTAL            (32768U)
#define BOARD_FREQ_SLCK_BYPASS          (32768U)
#define BOARD_FREQ_MAINCK_XTAL          (12000000U)
#define BOARD_FREQ_MAINCK_BYPASS        (12000000U)

/** Master clock frequency */
#define BOARD_MCK                                       CHIP_FREQ_CPU_MAX

/** board main clock xtal startup time */
#define BOARD_OSC_STARTUP_US   15625

/*----------------------------------------------------------------------------*/

/**
 * \page sam4s_wpir-rdboard_info "SAM4S-WPIR-RD - Board informations"
 * This page lists several definition related to the board description.
 *
 * \section Definitions
 * - \ref BOARD_NAME
 */

/** Name of the board */
#define BOARD_NAME "SAM4S-WPIR-RD"
/** Board definition */
#define sam4swpirrd
/** Family definition */
#define sam4s
/** Core definition */
#define cortexm4

/*----------------------------------------------------------------------------*/

/**
 * \page sam4s_wpir-rd_piodef "SAM4S-WPIR-RD - PIO definitions"
 * This pages lists all the pio definitions. The constants
 * are named using the following convention: PIN_* for a constant which defines
 * a single Pin instance (but may include several PIOs sharing the same
 * controller), and PINS_* for a list of Pin instances.
 *
 * ADC
 * - \ref PIN_ADC0_AD0
 * - \ref PIN_ADC0_AD4
 * - \ref PIN_ADC0_AD5
 * - \ref PINS_ADC
 *
 * UART
 * - \ref PINS_UART
 *
 * EBI
 * - \ref PIN_EBI_DATA_BUS
 * - \ref PIN_EBI_NRD
 * - \ref PIN_EBI_NWE
 * - \ref PIN_EBI_NCS0
 * - \ref PIN_EBI_SRAM_ADDR_BUS
 * - \ref PIN_EBI_SRAM_NBS
 * - \ref PIN_EBI_A1
 * - \ref PIN_EBI_NCS1
 * - \ref PIN_EBI_LCD_RS
 *
 * LEDs
 * - \ref PIN_LED_0
 * - \ref PINS_LEDS
 *
 * Push buttons
 * - \ref PIN_PUSHBUTTON_1
 * - \ref PINS_PUSHBUTTONS
 * - \ref PUSHBUTTON_BP1
 *
 * SPI
 * - \ref PIN_SPI_MISO
 * - \ref PIN_SPI_MOSI
 * - \ref PIN_SPI_SPCK
 * - \ref PINS_SPI
 * - \ref PIN_SPI_NPCS0_PA11
 *
 * PCK0
 * - \ref PIN_PCK0
 *
 * PIO PARALLEL CAPTURE
 * - \ref PIN_PIODCEN1
 * - \ref PIN_PIODCEN2
 *
 * TWI
 * - \ref PIN_TWI_TWD0
 * - \ref PIN_TWI_TWCK0
 * - \ref PINS_TWI0
 *
 * USB
 * - \ref PIN_USB_VBUS
 */

/******************************* ADC definition ******************************/

/** ADC_AD0 pin. */
#define PIN_ADC0_AD0                   {PIO_PA17, PIOA, ID_PIOA, PIO_INPUT, \
                                         PIO_DEFAULT}

/** ADC_AD4 pin. */
#define PIN_ADC0_AD4                   {PIO_PB0, PIOB, ID_PIOB, PIO_INPUT, \
                                         PIO_DEFAULT}

/** ADC_AD5 pin. */
#define PIN_ADC0_AD5                   {PIO_PB1, PIOB, ID_PIOB, PIO_INPUT, \
                                         PIO_DEFAULT}

/** ADC_AD0 pin definition. */
#define ADC0_AD0_GPIO                  (PIO_PA17_IDX)
#define ADC0_AD0_FLAGS                 (PIO_INPUT | PIO_DEFAULT)
#define ADC0_AD0_MASK                  PIO_PA17
#define ADC0_AD0_PIO                   PIOA
#define ADC0_AD0_ID                    ID_PIOA
#define ADC0_AD0_TYPE                  PIO_INPUT
#define ADC0_AD0_ATTR                  PIO_DEFAULT

/** ADC_AD4 pin definition. */
#define ADC0_AD4_GPIO                  (PIO_PB0_IDX)
#define ADC0_AD4_FLAGS                 (PIO_INPUT | PIO_DEFAULT)
#define ADC0_AD4_MASK                  PIO_PB0
#define ADC0_AD4_PIO                   PIOB
#define ADC0_AD4_ID                    ID_PIOB
#define ADC0_AD4_TYPE                  PIO_INPUT
#define ADC0_AD4_ATTR                  PIO_DEFAULT

/** ADC_AD5 pin definition. */
#define ADC0_AD5_GPIO                  (PIO_PB1_IDX)
#define ADC0_AD5_FLAGS                 (PIO_INPUT | PIO_DEFAULT)
#define ADC0_AD5_MASK                  PIO_PB1
#define ADC0_AD5_PIO                   PIOB
#define ADC0_AD5_ID                    ID_PIOB
#define ADC0_AD5_TYPE                  PIO_INPUT
#define ADC0_AD5_ATTR                  PIO_DEFAULT

/** Pins ADC */
#define PINS_ADC                       PIN_ADC0_AD0, PIN_ADC0_AD4, PIN_ADC0_AD5

/** Startup time max, return from Idle mode (in µs) */
#define ADC_STARTUP_TIME_MAX           (15)
/** Track and hold Acquisition Time min (in ns) */
#define ADC_TRACK_HOLD_TIME_MIN        (1200)
/** ADC clock frequence */
#define BOARD_ADC_FREQ                 (6000000UL)

/******************************* UART definition ******************************/

/** UART pins (UTXD0 and URXD0) definitions, PA9,10. */
#define PINS_UART                      (PIO_PA9A_URXD0 | PIO_PA10A_UTXD0)
#define PINS_UART_FLAGS                (PIO_PERIPH_A | PIO_DEFAULT)

#define PINS_UART_MASK                 PIO_PA9A_URXD0 | PIO_PA10A_UTXD0
#define PINS_UART_PIO                  PIOA
#define PINS_UART_ID                   ID_PIOA
#define PINS_UART_TYPE                 PIO_PERIPH_A
#define PINS_UART_ATTR                 PIO_DEFAULT

#define CONSOLE_UART                   UART0
#define CONSOLE_UART_ID                ID_UART0

/******************************* EBI definition ******************************/
/** EBI Data Bus pins */
#define PIN_EBI_DATA_BUS_D0            PIO_PC0_IDX
#define PIN_EBI_DATA_BUS_D1            PIO_PC1_IDX
#define PIN_EBI_DATA_BUS_D2            PIO_PC2_IDX
#define PIN_EBI_DATA_BUS_D3            PIO_PC3_IDX
#define PIN_EBI_DATA_BUS_D4            PIO_PC4_IDX
#define PIN_EBI_DATA_BUS_D5            PIO_PC5_IDX
#define PIN_EBI_DATA_BUS_D6            PIO_PC6_IDX
#define PIN_EBI_DATA_BUS_D7            PIO_PC7_IDX
#define PIN_EBI_DATA_BUS_FLAGS         PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_DATA_BUS_MASK          (0xFF)
#define PIN_EBI_DATA_BUS_PIO           PIOC
#define PIN_EBI_DATA_BUS_ID            ID_PIOC
#define PIN_EBI_DATA_BUS_TYPE          PIO_PERIPH_A
#define PIN_EBI_DATA_BUS_ATTR          PIO_PULLUP

