remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam/boards/sam4s_wpir_rd/sam4s_wpir_rd.h
#define PIN_EBI_DATA_BUS               {0xFF, PIOC, ID_PIOC, PIO_PERIPH_A, \
                                         PIO_PULLUP}

/** EBI NRD pin */
#define PIN_EBI_NRD                    PIO_PC11_IDX
#define PIN_EBI_NRD_FLAGS              PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NRD_MASK               PIO_PC11
#define PIN_EBI_NRD_PIO                PIOC
#define PIN_EBI_NRD_ID                 ID_PIOC
#define PIN_EBI_NRD_TYPE               PIO_PERIPH_A
#define PIN_EBI_NRD_ATTR               PIO_PULLUP

/** EBI NWE pin */
#define PIN_EBI_NWE                    PIO_PC8_IDX
#define PIN_EBI_NWE_FLAGS              PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NWE_MASK               PIO_PC8
#define PIN_EBI_NWE_PIO                PIOC
#define PIN_EBI_NWE_ID                 ID_PIOC
#define PIN_EBI_NWE_TYPE               PIO_PERIPH_A
#define PIN_EBI_NWE_ATTR               PIO_PULLUP

/** EBI NCS0 pin */
#define PIN_EBI_NCS0                   PIO_PC14_IDX
#define PIN_EBI_NCS0_FLAGS             PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_NCS0_MASK              PIO_PC14
#define PIN_EBI_NCS0_PIO               PIOC
#define PIN_EBI_NCS0_ID                ID_PIOC
#define PIN_EBI_NCS0_TYPE              PIO_PERIPH_A
#define PIN_EBI_NCS0_ATTR              PIO_PULLUP

/** EBI pins for SRAM address bus */
#define PIN_EBI_ADDR_BUS_A19           PIO_PC16_IDX /* A19 */
#define PIN_EBI_ADDR_BUS_A0            PIO_PC18_IDX /* A0 */
#define PIN_EBI_ADDR_BUS_A1            PIO_PC19_IDX /* A1 */
#define PIN_EBI_ADDR_BUS_A2            PIO_PC20_IDX /* A2 */
#define PIN_EBI_ADDR_BUS_A3            PIO_PC21_IDX /* A3 */
#define PIN_EBI_ADDR_BUS_A4            PIO_PC22_IDX /* A4 */
#define PIN_EBI_ADDR_BUS_A5            PIO_PC23_IDX /* A5 */
#define PIN_EBI_ADDR_BUS_A6            PIO_PC24_IDX /* A6 */
#define PIN_EBI_ADDR_BUS_A7            PIO_PC25_IDX /* A7 */
#define PIN_EBI_ADDR_BUS_A8            PIO_PC26_IDX /* A8 */
#define PIN_EBI_ADDR_BUS_A9            PIO_PC27_IDX /* A9 */
#define PIN_EBI_ADDR_BUS_A10           PIO_PC28_IDX /* A10 */
#define PIN_EBI_ADDR_BUS_A11           PIO_PC29_IDX /* A11 */
#define PIN_EBI_ADDR_BUS_A12           PIO_PC30_IDX /* A12 */
#define PIN_EBI_ADDR_BUS_A13           PIO_PC31_IDX /* A13 */
#define PIN_EBI_ADDR_BUS_FLAG1         PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_SRAM_ADDR_PIOC         {0xFFFD0000, PIOC, ID_PIOC, \
                                         PIO_PERIPH_A, PIO_PULLUP}

#define PIN_EBI_ADDR_BUS_A14           PIO_PA18_IDX /* A14 */
#define PIN_EBI_ADDR_BUS_A15           PIO_PA19_IDX /* A15 */
#define PIN_EBI_ADDR_BUS_A16           PIO_PA20_IDX /* A16 */
#define PIN_EBI_ADDR_BUS_A17           PIO_PA0_IDX  /* A17 */
#define PIN_EBI_ADDR_BUS_A18           PIO_PA1_IDX  /* A18 */
#define PIN_EBI_ADDR_BUS_FLAG2         PIO_PERIPH_C | PIO_PULLUP
#define PIN_EBI_SRAM_ADDR_PIOA         {0x001C0003, PIOA, ID_PIOA, \
                                         PIO_PERIPH_C, PIO_PULLUP}

/** EBI NCS2 pin */
#define PIN_EBI_NCS2                   PIO_PA22_IDX /* LCD CS pin */
#define PIN_EBI_NCS2_FLAGS             PIO_PERIPH_C | PIO_PULLUP
#define PIN_EBI_NCS2_MASK              PIO_PA22
#define PIN_EBI_NCS2_PIO               PIOA
#define PIN_EBI_NCS2_ID                ID_PIOA
#define PIN_EBI_NCS2_TYPE              PIO_PERIPH_C
#define PIN_EBI_NCS2_ATTR              PIO_PULLUP

/** EBI pin for LCD RS */
#define PIN_EBI_LCD_RS                 PIO_PC19_IDX /* LCD RS pin */
#define PIN_EBI_LCD_RS_FLAGS           PIO_PERIPH_A | PIO_PULLUP
#define PIN_EBI_LCD_RS_MASK            PIO_PC19
#define PIN_EBI_LCD_RS_PIO             PIOC
#define PIN_EBI_LCD_RS_ID              ID_PIOC
#define PIN_EBI_LCD_RS_TYPE            PIO_PERIPH_A
#define PIN_EBI_LCD_RS_ATTR            PIO_PULLUP

/******************************* LED definition ******************************/
/** LED #0 pin definition (BLUE). */
#define LED_0_NAME                     "blue LED D1"
#define PIN_LED_0                      {PIO_PC12, PIOC, ID_PIOC, PIO_OUTPUT_1,	\
                                         PIO_DEFAULT}
#define PIN_LED_0_MASK                 PIO_PC12
#define PIN_LED_0_PIO                  PIOC
#define PIN_LED_0_ID                   ID_PIOC
#define PIN_LED_0_TYPE                 PIO_OUTPUT_1
#define PIN_LED_0_ATTR                 PIO_DEFAULT

#define LED0_GPIO                      (PIO_PC12_IDX)
#define LED0_FLAGS                     (PIO_OUTPUT_1 | PIO_DEFAULT)

/**Led blue index. */
#define LED_BLUE                       (0UL)

/** List of all LEDs definitions. */
#define PINS_LEDS                      PIN_LED_0

/******************************* Push-button definition
 *******************************/

/** Push button #1 definition. Attributes = pull-up + debounce + interrupt on
 * rising edge. */
#define PUSHBUTTON_1_NAME              "USRPB1"
#define PIN_PUSHBUTTON_1               {PIO_PA2, PIOA, ID_PIOA, PIO_INPUT, \
                                         PIO_PULLUP | PIO_DEBOUNCE | \
                                         PIO_IT_RISE_EDGE}
#define PIN_PUSHBUTTON_1_MASK          PIO_PA2
#define PIN_PUSHBUTTON_1_PIO           PIOA
#define PIN_PUSHBUTTON_1_ID            ID_PIOA
#define PIN_PUSHBUTTON_1_TYPE          PIO_INPUT
#define PIN_PUSHBUTTON_1_ATTR          PIO_PULLUP | PIO_DEBOUNCE | \
                                         PIO_IT_RISE_EDGE

#define GPIO_PUSH_BUTTON_1             (PIO_PA2_IDX)
#define GPIO_PUSH_BUTTON_1_FLAGS       (PIO_INPUT | PIO_PULLUP | PIO_DEBOUNCE | \
                                         PIO_IT_RISE_EDGE)

/** Push button #1 index. */
#define PUSHBUTTON_BP1                 (0UL)

/** List of all push button definitions. */
#define PINS_PUSHBUTTONS               PIN_PUSHBUTTON_1

/******************************* SPI definition
 *********************************/
/** SPI MISO pin. */
#define PIN_SPI_MISO                   {PIO_PA12A_MISO, PIOA, ID_PIOA,	\
                                         PIO_PERIPH_A, PIO_DEFAULT}

/** SPI MOSI pin. */
#define PIN_SPI_MOSI                   {PIO_PA13A_MOSI, PIOA, ID_PIOA,	\
                                         PIO_PERIPH_A, PIO_DEFAULT}

