remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam/boards/sam4s_wpir_rd/sam4s_wpir_rd.h
/** SPI SPCK pin. */
#define PIN_SPI_SPCK                   {PIO_PA14A_SPCK, PIOA, ID_PIOA,	\
                                         PIO_PERIPH_A, PIO_DEFAULT}

/** SPI chip select pin. */
#define PIN_SPI_NPCS0                  {PIO_PA11A_NPCS0, PIOA, ID_PIOA, \
                                         PIO_PERIPH_A, PIO_DEFAULT}

/** SPI MISO pin definition. */
#define SPI_MISO_GPIO                  (PIO_PA12_IDX)
#define SPI_MISO_FLAGS                 (PIO_PERIPH_A | PIO_DEFAULT)
#define SPI_MISO_MASK                  PIO_PA12
#define SPI_MISO_PIO                   PIOA
#define SPI_MISO_ID                    ID_PIOA
#define SPI_MISO_TYPE                  PIO_PERIPH_A
#define SPI_MISO_ATTR                  PIO_DEFAULT

/** SPI MOSI pin definition. */
#define SPI_MOSI_GPIO                  (PIO_PA13_IDX)
#define SPI_MOSI_FLAGS                 (PIO_PERIPH_A | PIO_DEFAULT)
#define SPI_MOSI_MASK                  PIO_PA13
#define SPI_MOSI_PIO                   PIOA
#define SPI_MOSI_ID                    ID_PIOA
#define SPI_MOSI_TYPE                  PIO_PERIPH_A
#define SPI_MOSI_ATTR                  PIO_DEFAULT

/** SPI SPCK pin definition. */
#define SPI_SPCK_GPIO                  (PIO_PA14_IDX)
#define SPI_SPCK_FLAGS                 (PIO_PERIPH_A | PIO_DEFAULT)
#define SPI_SPCK_MASK                  PIO_PA14
#define SPI_SPCK_PIO                   PIOA
#define SPI_SPCK_ID                    ID_PIOA
#define SPI_SPCK_TYPE                  PIO_PERIPH_A
#define SPI_SPCK_ATTR                  PIO_DEFAULT

/** SPI chip select 0 pin definition. */
#define SPI_NPCS0_GPIO                 (PIO_PA11_IDX)
#define SPI_NPCS0_FLAGS                (PIO_PERIPH_A | PIO_DEFAULT)
#define SPI_NPCS0_MASK                 PIO_PA11
#define SPI_NPCS0_PIO                  PIOA
#define SPI_NPCS0_ID                   ID_PIOA
#define SPI_NPCS0_TYPE                 PIO_PERIPH_A
#define SPI_NPCS0_ATTR                 PIO_DEFAULT

/** List of SPI pin definitions (MISO, MOSI & SPCK). */
#define PINS_SPI                       PIN_SPI_MISO, PIN_SPI_MOSI, PIN_SPI_SPCK

/******************************* PCK0 definition
 *********************************/
/** PCK0 */
#define PIN_PCK0                       (PIO_PB13_IDX)
#define PIN_PCK0_FLAGS                 (PIO_PERIPH_B | PIO_DEFAULT)

/******************************* TWI definition
 *********************************/
/** TWI0 data pin */
#define PIN_TWI_TWD0                   {PIO_PA3A_TWD0, PIOA, ID_PIOA, \
                                         PIO_PERIPH_A, PIO_DEFAULT}

/** TWI0 clock pin */
#define PIN_TWI_TWCK0                  {PIO_PA4A_TWCK0, PIOA, ID_PIOA,	\
                                         PIO_PERIPH_A, PIO_DEFAULT}

/** TWI0 Data pins definition */
#define TWI0_DATA_GPIO                 PIO_PA3_IDX
#define TWI0_DATA_FLAGS                (PIO_PERIPH_A | PIO_DEFAULT)
#define TWI0_DATA_MASK                 PIO_PA3
#define TWI0_DATA_PIO                  PIOA
#define TWI0_DATA_ID                   ID_PIOA
#define TWI0_DATA_TYPE                 PIO_PERIPH_A
#define TWI0_DATA_ATTR                 PIO_DEFAULT

/** TWI0 clock pins definition */
#define TWI0_CLK_GPIO                  PIO_PA4_IDX
#define TWI0_CLK_FLAGS                 (PIO_PERIPH_A | PIO_DEFAULT)
#define TWI0_CLK_MASK                  PIO_PA4
#define TWI0_CLK_PIO                   PIOA
#define TWI0_CLK_ID                    ID_PIOA
#define TWI0_CLK_TYPE                  PIO_PERIPH_A
#define TWI0_CLK_ATTR                  PIO_DEFAULT

/** TWI0 pins */
#define PINS_TWI0                      PIN_TWI_TWD0, PIN_TWI_TWCK0

#define ID_BOARD_TWI		               ID_TWI0
#define BOARD_TWI			                 TWI0
#define BOARD_TWI_IRQn		             TWI0_IRQn

/******************************* VBUS definition
 *********************************/
/** USB VBUS pin */
#define PIN_USB_VBUS                   {PIO_PC17, PIOC, ID_PIOC, \
                                         PIO_INPUT, PIO_PULLUP}

/** USB VBUS pin definition */
#define USB_VBUS_GPIO                  PIO_PC17_IDX
#define USB_VBUS_FLAGS                 (PIO_INPUT | PIO_PULLUP)
#define USB_VBUS_MASK                  PIO_PC17
#define USB_VBUS_PIO                   PIOC
#define USB_VBUS_ID                    ID_PIOC
#define USB_VBUS_TYPE                  PIO_INPUT

/*----------------------------------------------------------------------------*/

/**
 * \page sam4s_wpir_rd_extcomp "SAM4S-WPIR-RD - External components"
 * This page lists the definitions related to external on-board components
 * located in the board.h file for the ATSAM4S-WPIR-RD.
 *
 * LCD
 * - \ref BOARD_LCD_ILI9325
 * - \ref BOARD_LCD_PINS
 * - \ref BOARD_BACKLIGHT_PIN
 * - \ref BOARD_LCD_BASE
 * - \ref BOARD_LCD_RS
 * - \ref BOARD_LCD_WIDTH
 * - \ref BOARD_LCD_HEIGHT
 *
 * SRAM
 * - \ref PIN_SRAM_VCC
 * - \ref BOARD_SRAM_PINS
 * - \ref BOARD_SRAM_BASE
 * - \ref BOARD_SRAM_LENGTH
 *
 * PIR
 * - \ref PINS_PIR
 *
 * Image sensor
 * - \ref PIN_OV_SW_OVT
 * - \ref PIN_OV_RST
 * - \ref PIN_OV_FSIN
 * - \ref PIN_OV_HSYNC
 * - \ref PIN_OV_VSYNC
 * - \ref  PINS_OV
 *
 */

/******************************* LCD definition
 *********************************/
/** board has an ILI9325 external component to manage LCD. */
#define BOARD_LCD_ILI9325

/** Backlight pin. */
#define BOARD_BACKLIGHT_PIN            {PIO_PC13, PIOC, ID_PIOC, \
                                        PIO_OUTPUT_0, PIO_DEFAULT}

/** Backlight pin definition */
#define BOARD_AAT31XX_SET_GPIO         PIO_PC13_IDX
#define BOARD_AAT31XX_SET_FLAGS        (PIO_OUTPUT_0 | PIO_DEFAULT)
#define PIN_BOARD_BACKLIGHT_MASK       PIO_PC13
#define PIN_BOARD_BACKLIGHT_PIO        PIOC
#define PIN_BOARD_BACKLIGHT_ID         ID_PIOC
#define PIN_BOARD_BACKLIGHT_TYPE       PIO_OUTPUT_0
#define PIN_BOARD_BACKLIGHT_ATTR       PIO_PULLUP

/** LCD pins list. */
#define BOARD_LCD_PINS                 PIN_EBI_DATA_BUS, PIN_EBI_NRD, \
                                        PIN_EBI_NWE, PIN_EBI_NCS2, \
                                        PIN_EBI_LCD_RS

/** Define ILI9325 base address. */
#define BOARD_ILI9325_ADDR             (0x62000000UL)

/** Define ILI9325 register select signal. */
#define BOARD_ILI9325_RS               (1UL << 1)

