remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam/boards/sam4s_wpir_rd/sam4s_wpir_rd.h
/** Display width in pixels. */
#define BOARD_LCD_WIDTH                (240UL)

/** Display height in pixels. */
#define BOARD_LCD_HEIGHT               (320UL)

/** Define ILI9325 chip select. */
#define BOARD_LCD_SMC_CS               (2UL)

/** Define ILI9325 chip select. */
#define BOARD_LCD_SMC_SETUP            (SMC_SETUP_NWE_SETUP(2) | \
                                        SMC_SETUP_NCS_WR_SETUP(2) | \
                                        SMC_SETUP_NRD_SETUP(2) | \
                                        SMC_SETUP_NCS_RD_SETUP(2))

/** Define ILI9325 chip select. */
#define BOARD_LCD_SMC_PULSE            (SMC_PULSE_NWE_PULSE(4) | \
                                        SMC_PULSE_NCS_WR_PULSE(4) | \
                                        SMC_PULSE_NRD_PULSE(10) | \
                                        SMC_PULSE_NCS_RD_PULSE(10))

/** Define ILI9325 chip select. */
#define BOARD_LCD_SMC_CYCLE            (SMC_CYCLE_NWE_CYCLE(10) | \
                                        SMC_CYCLE_NRD_CYCLE(22))

/** Define ILI9325 chip select. */
#define BOARD_LCD_SMC_MODE             (SMC_MODE_READ_MODE| \
                                        SMC_MODE_WRITE_MODE)

/******************************* SRAM definition
 *********************************/
/** SRAM_VCC pins */
#define PIN_SRAM_VCC                   { PIO_PC9, PIOC, ID_PIOC, \
                                         PIO_OUTPUT_0, PIO_DEFAULT }

/** SRAM_VCC pins definition */
#define SRAM_VCC_GPIO                  PIO_PC9_IDX
#define SRAM_VCC_FLAGS                 (PIO_OUTPUT_0 | PIO_DEFAULT)
#define SRAM_VCC_MASK                  PIO_PC9
#define SRAM_VCC_PIO                   PIOC
#define SRAM_VCC_ID                    ID_PIOC
#define SRAM_VCC_TYPE                  PIO_OUTPUT_0

/** SRAM pins list */
#define BOARD_SRAM_PINS                PIN_EBI_DATA_BUS, PIN_EBI_NCS0,	\
  PIN_EBI_NRD, PIN_EBI_NWE, PIN_SRAM_VCC,	\
  PIN_EBI_SRAM_ADDR_PIOA, PIN_EBI_SRAM_ADDR_PIOC

/** Define SRAM base address. */
#define BOARD_SRAM_BASE                ((void *)0x60000000UL)

/** Define SRAM chip select. */
#define BOARD_SRAM_CS                  (0UL)

/** Define SRAM length. */
#define BOARD_SRAM_LENGTH              ((uint32_t)0x00100000UL)

/******************************* PIR definition
 *********************************/
/** List of PIR sensor definitions. */
#define PINS_PIR                       PIN_ADC0_AD0

/******************************* Image sensor definition
 *********************************/
/** pin for OV_VDD */
#define PIN_OV_SW_OVT                  { PIO_PC10, PIOC, ID_PIOC, \
                                         PIO_OUTPUT_1, PIO_DEFAULT} /* OV_VDD */
#define PIN_OV_RST                     { PIO_PC15, PIOC, ID_PIOC, \
                                         PIO_OUTPUT_1, PIO_DEFAULT}
#define PIN_OV_FSIN                    { PIO_PA21, PIOA, ID_PIOA, \
                                         PIO_OUTPUT_0, PIO_DEFAULT}

/** HSYNC pin */
#define PIN_OV_HSYNC                   { PIO_PA16, PIOA, ID_PIOA, \
                                         PIO_INPUT, PIO_PULLUP | \
                                         PIO_IT_RISE_EDGE }

/** VSYNC pin */
#define PIN_OV_VSYNC                   { PIO_PA15, PIOA, ID_PIOA, \
                                         PIO_INPUT, PIO_PULLUP | \
                                         PIO_IT_RISE_EDGE }

/** OV_SW_OVT pin definition */
#define OV_SW_OVT_GPIO                 PIO_PC10_IDX
#define OV_SW_OVT_FLAGS                (PIO_OUTPUT_1 | PIO_DEFAULT)
#define OV_SW_OVT_MASK                 PIO_PC10
#define OV_SW_OVT_PIO                  PIOC
#define OV_SW_OVT_ID                   ID_PIOC
#define OV_SW_OVT_TYPE                 PIO_OUTPUT_1

/** OV_RST pin definition */
#define OV_RST_GPIO                    PIO_PC15_IDX
#define OV_RST_FLAGS                   (PIO_OUTPUT_1 | PIO_DEFAULT)
#define OV_RST_MASK                    PIO_PC15
#define OV_RST_PIO                     PIOC
#define OV_RST_ID                      ID_PIOC
#define OV_RST_TYPE                    PIO_OUTPUT_1

/** OV_RST pin definition */
#define OV_FSIN_GPIO                   PIO_PA21_IDX
#define OV_FSIN_FLAGS                  (PIO_OUTPUT_0 | PIO_DEFAULT)
#define OV_FSIN_MASK                   PIO_PA21
#define OV_FSIN_PIO                    PIOA
#define OV_FSIN_ID                     ID_PIOA
#define OV_FSIN_TYPE                   PIO_OUTPUT_0

/** OV_HSYNC pin definition */
#define OV_HSYNC_GPIO                  PIO_PA16_IDX
#define OV_HSYNC_FLAGS                 (PIO_PULLUP | PIO_IT_RISE_EDGE)
#define OV_HSYNC_MASK                  PIO_PA16
#define OV_HSYNC_PIO                   PIOA
#define OV_HSYNC_ID                    ID_PIOA
#define OV_HSYNC_TYPE                  PIO_PULLUP

/** OV_VSYNC pin definition */
#define OV_VSYNC_GPIO                  PIO_PA15_IDX
#define OV_VSYNC_FLAGS                 (PIO_PULLUP | PIO_IT_RISE_EDGE)
#define OV_VSYNC_MASK                  PIO_PA15
#define OV_VSYNC_PIO                   PIOA
#define OV_VSYNC_ID                    ID_PIOA
#define OV_VSYNC_TYPE                  PIO_PULLUP

/** OV Data Bus pins */
#define OV_DATA_BUS_D2                 PIO_PA24_IDX
#define OV_DATA_BUS_D3                 PIO_PA25_IDX
#define OV_DATA_BUS_D4                 PIO_PA26_IDX
#define OV_DATA_BUS_D5                 PIO_PA27_IDX
#define OV_DATA_BUS_D6                 PIO_PA28_IDX
#define OV_DATA_BUS_D7                 PIO_PA29_IDX
#define OV_DATA_BUS_D8                 PIO_PA30_IDX
#define OV_DATA_BUS_D9                 PIO_PA31_IDX
#define OV_DATA_BUS_FLAGS              (PIO_INPUT | PIO_PULLUP)
#define OV_DATA_BUS_MASK               (0xFF000000UL)
#define OV_DATA_BUS_PIO                PIOA
#define OV_DATA_BUS_ID                 ID_PIOA
#define OV_DATA_BUS_TYPE               PIO_INPUT
#define OV_DATA_BUS_ATTR               PIO_DEFAULT

/** List of Image sensor definitions. */
#define PINS_OV                        PIN_OV_SW_OVT, PIN_PCK0, PIN_OV_RST


/******************************* Parallel Capture definition
 *********************************/
/** Parallel Capture Mode Data Enable1 */
#define PIN_PIODCEN1                   PIO_PA15

/** Parallel Capture Mode Data Enable2 */
#define PIN_PIODCEN2                   PIO_PA16

/******************************* DEBUG definition
 *********************************/
#define PIN_PA11_DEBUG                 {PIO_PA11, PIOA, ID_PIOA, \
                                         PIO_OUTPUT_0, PIO_DEFAULT}
#define PIN_PA5_DEBUG                  {PIO_PA5, PIOA, ID_PIOA, \
                                         PIO_OUTPUT_0, PIO_DEFAULT}
#define PIN_DEBUG                      PIN_PA11_DEBUG, PIN_PA5_DEBUG

/*----------------------------------------------------------------------------*/

/**
 * \page sam4s_wpir_rd_usb "SAM4S-WPIR-RD - USB device"
 *
 * \section Definitions
 * - \ref BOARD_USB_BMATTRIBUTES
 * - \ref CHIP_USB_UDP
 * - \ref CHIP_USB_PULLUP_INTERNAL
 * - \ref CHIP_USB_NUMENDPOINTS
 * - \ref CHIP_USB_ENDPOINTS_MAXPACKETSIZE
 * - \ref CHIP_USB_ENDPOINTS_BANKS
 */

/** USB attributes configuration descriptor (bus or self powered, remote wakeup)
**/
#define BOARD_USB_BMATTRIBUTES   USBConfigurationDescriptor_SELFPOWERED_RWAKEUP

/** Indicates chip has an UDP Full Speed. */
#define CHIP_USB_UDP

/** Indicates chip has an internal pull-up. */
#define CHIP_USB_PULLUP_INTERNAL

/** Number of USB endpoints */
#define CHIP_USB_NUMENDPOINTS          (8)

/** Endpoints max paxcket size */
#define CHIP_USB_ENDPOINTS_MAXPACKETSIZE(i) \
  ((i == 0) ? 64 : \
  ((i == 1) ? 64 : \
  ((i == 2) ? 64 : \
  ((i == 3) ? 64 : \
  ((i == 4) ? 512 : \
  ((i == 5) ? 512 : \
  ((i == 6) ? 64 : \
  ((i == 7) ? 64 : 0))))))))

/** Endpoints Number of Bank */
#define CHIP_USB_ENDPOINTS_BANKS(i) \
  ((i == 0) ? 1 :	\
  ((i == 1) ? 2 :	\
  ((i == 2) ? 2 :	\
  ((i == 3) ? 1 :	\
  ((i == 4) ? 2 :	\
  ((i == 5) ? 2 :	\
  ((i == 6) ? 2 :	\
  ((i == 7) ? 2 : 0))))))))

#endif /* #ifndef _BOARD_ */
